app/controllers/welcome_controller.rb

  def newoffer
    require 'pp'
    offer = Offer.new
    offer.challenge = params["challenge"]
    offer.requirement = params["requirement"]
    offer.budget = params["budget"]
    offer.organization = params["organization"]
    offer.name = params["name"]
    offer.email = params["email"]
    offer.phone = params["phone"]
    offer.save
---
INSERT INTO "offers" ("budget", "challenge", "created_at", "email", "name", "organization", "phone", "requirement", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?)